/**
 ****************************************************************************************************
 * @file        test.h
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2020-04-17
 * @brief       战舰发货测试代码
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 * @attention
 *
 * 实验平台:正点原子 STM32F103开发板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 *
 * 修改说明
 * V1.0 20200417
 * 第一次发布
 *
 ****************************************************************************************************
 */

#ifndef __TEST_H
#define __TEST_H
#include "./SYSTEM/sys/sys.h"

/******************************************************************************************/
#define APP_TEST_FLAG_ADD       253                 /* 存放出厂是否经过测试的标志位地址 */
#define APP_TEST_FLAG_VAL       0X0A                 /* 存放出厂是否经过测试的标志位值 */

/******************************************************************************************/
void test_system(void);                             /* 测试流程函数 */
#endif

















